droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_adc_result_regs.xml
<module id="ADC_RESULT_REGS" HW_revision="" description="ADC RESULT Registers">
	<register id="ADCRESULT0" width="16" page="1" offset="0x0" internal="0" description="ADC Result 0 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT1" width="16" page="1" offset="0x1" internal="0" description="ADC Result 1 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT2" width="16" page="1" offset="0x2" internal="0" description="ADC Result 2 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT3" width="16" page="1" offset="0x3" internal="0" description="ADC Result 3 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT4" width="16" page="1" offset="0x4" internal="0" description="ADC Result 4 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT5" width="16" page="1" offset="0x5" internal="0" description="ADC Result 5 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT6" width="16" page="1" offset="0x6" internal="0" description="ADC Result 6 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT7" width="16" page="1" offset="0x7" internal="0" description="ADC Result 7 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT8" width="16" page="1" offset="0x8" internal="0" description="ADC Result 8 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT9" width="16" page="1" offset="0x9" internal="0" description="ADC Result 9 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT10" width="16" page="1" offset="0xa" internal="0" description="ADC Result 10 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT11" width="16" page="1" offset="0xb" internal="0" description="ADC Result 11 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT12" width="16" page="1" offset="0xc" internal="0" description="ADC Result 12 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT13" width="16" page="1" offset="0xd" internal="0" description="ADC Result 13 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT14" width="16" page="1" offset="0xe" internal="0" description="ADC Result 14 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCRESULT15" width="16" page="1" offset="0xf" internal="0" description="ADC Result 15 Register">
		<bitfield id="RESULT" description="ADC Result" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB1RESULT" width="32" page="1" offset="0x10" internal="0" description="ADC Post Processing Block 1 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB2RESULT" width="32" page="1" offset="0x12" internal="0" description="ADC Post Processing Block 2 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB3RESULT" width="32" page="1" offset="0x14" internal="0" description="ADC Post Processing Block 3 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="ADCPPB4RESULT" width="32" page="1" offset="0x16" internal="0" description="ADC Post Processing Block 4 Result Register">
		<bitfield id="PPBRESULT" description="ADC Post Processing Block Result" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
</module>
